/*
    FAT32.cpp
    FAT32 filesystem Routines in the PETdisk storage device
    Copyright (C) 2011 Michael Hill

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
    
    Contact the author at bitfixer@bitfixer.com
    http://bitfixer.com
*/

#include "FAT32.h"
#include "SD_routines.h"
#include <string.h>
#include <ctype.h>
#include "Serial.h"
#include <stdio.h>

//Attribute definitions for file/directory
#define ATTR_READ_ONLY     0x01
#define ATTR_HIDDEN        0x02
#define ATTR_SYSTEM        0x04
#define ATTR_VOLUME_ID     0x08
#define ATTR_DIRECTORY     0x10
#define ATTR_ARCHIVE       0x20
#define ATTR_LONG_NAME     0x0f


#define DIR_ENTRY_SIZE     0x32
#define EMPTY              0x00
#define DELETED            0xe5
#define GET                0
#define SET                1
#define READ               0
#define VERIFY             1
#define ADD                0
#define REMOVE             1
#define LOW                0
#define HIGH               1
#define TOTAL_FREE         1
#define NEXT_FREE          2
#define GET_LIST           0
#define GET_FILE           1
#define DELETE             2
#define FAT_EOF            0x0fffffff

//Structure to access Master Boot Record for getting info about partitions
struct PACKED MBRinfo_Structure{
uint8_t   nothing[446];       //ignore, placed here to fill the gap in the structure
uint8_t   partitionData[64];  //partition records (16x4)
uint16_t    signature;      //0xaa55
};

//Structure to access info of the first partioion of the disk 
struct PACKED partitionInfo_Structure{                 
uint8_t   status;             //0x80 - active partition
uint8_t   headStart;          //starting head
uint16_t    cylSectStart;       //starting cylinder and sector
uint8_t   type;               //partition type 
uint8_t   headEnd;            //ending head of the partition
uint16_t    cylSectEnd;         //ending cylinder and sector
uint32_t   firstSector;        //total sectors between MBR & the first sector of the partition
uint32_t   sectorsTotal;       //size of this partition in sectors
};

//Structure to access boot sector data
struct PACKED BS_Structure{
uint8_t jumpBoot[3]; //default: 0x009000EB   //3
uint8_t OEMName[8];                          //11
uint16_t bytesPerSector; //deafault: 512       //13
uint8_t sectorPerCluster;                    //14
uint16_t reservedSectorCount;                  //16
uint8_t numberofFATs;                        //17
uint16_t rootEntryCount;                       //19
uint16_t totalSectors_F16; //must be 0 for FAT32    //21
uint8_t mediaType;                           //22
uint16_t FATsize_F16; //must be 0 for FAT32    //24
uint16_t sectorsPerTrack;                      //26
uint16_t numberofHeads;                        //28
uint32_t hiddenSectors;                       //32
uint32_t totalSectors_F32;                    //36
uint32_t FATsize_F32; //count of sectors occupied by one FAT   //40
uint16_t extFlags;                              //42
uint16_t FSversion; //0x0000 (defines version 0.0)  //44
uint32_t rootCluster; //first cluster of root directory (=2) //48
uint16_t FSinfo; //sector number of FSinfo structure (=1)   //50
uint16_t BackupBootSector;                      //52
uint8_t reserved[12];                         //64
uint8_t driveNumber;                          //65
uint8_t reserved1;                            //66
uint8_t bootSignature;                        //67
uint32_t volumeID;                             //71
uint8_t volumeLabel[11]; //"NO NAME "         //82
uint8_t fileSystemType[8]; //"FAT32"          //90
uint8_t bootData[420];                        //510
uint16_t bootEndSignature; //0xaa55             //512
};


//Structure to access FSinfo sector data
struct PACKED FSInfo_Structure
{
uint32_t leadSignature; //0x41615252
uint8_t reserved1[480];
uint32_t structureSignature; //0x61417272
uint32_t freeClusterCount; //initial: 0xffffffff
uint32_t nextFreeCluster; //initial: 0xffffffff
uint8_t reserved2[12];
uint32_t trailSignature; //0xaa550000
};

namespace bitfixer {

bool FAT32::initWithParams(SD* sd, uint8_t* fatbuffer, uint8_t* longEntryBuffer, SerialLogger* logger)
{
    _sd = sd;
    _FatBuffer = fatbuffer;
    _longEntryString = longEntryBuffer;
    _logger = logger;
    return init();
}

bool FAT32::init()
{
    _initialized = false;
    if (_sd->init() != 0)
    {
        _initialized = false;
        return _initialized;
    }

    uint8_t res = getBootSectorData();
    if (res == 0)
    {
        _initialized = true;
    }
    
    return _initialized;
}


bool FAT32::isInitialized()
{
    return _initialized;
}
