/*
    FAT32.cpp
    FAT32 filesystem Routines in the PETdisk storage device
    Copyright (C) 2011 Michael Hill

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
    
    Contact the author at bitfixer@bitfixer.com
    http://bitfixer.com
*/

#include <avr/io.h>
#include <avr/pgmspace.h>
#include "FAT32.h"
#include "SD_routines.h"
#include <string.h>
#include <ctype.h>

// test
#include "Serial.h"
#include <stdio.h>

//Attribute definitions for file/directory
#define ATTR_READ_ONLY     0x01
#define ATTR_HIDDEN        0x02
#define ATTR_SYSTEM        0x04
#define ATTR_VOLUME_ID     0x08
#define ATTR_DIRECTORY     0x10
#define ATTR_ARCHIVE       0x20
#define ATTR_LONG_NAME     0x0f


#define DIR_ENTRY_SIZE     0x32
#define EMPTY              0x00
#define DELETED            0xe5
#define GET                0
#define SET                1
#define READ               0
#define VERIFY             1
#define ADD                0
#define REMOVE             1
#define LOW                0
#define HIGH               1
#define TOTAL_FREE         1
#define NEXT_FREE          2
#define GET_LIST           0
#define GET_FILE           1
#define DELETE             2
#define FAT_EOF            0x0fffffff

//Structure to access Master Boot Record for getting info about partitions
struct MBRinfo_Structure{
unsigned char   nothing[446];       //ignore, placed here to fill the gap in the structure
unsigned char   partitionData[64];  //partition records (16x4)
unsigned int    signature;      //0xaa55
};

//Structure to access info of the first partioion of the disk 
struct partitionInfo_Structure{                 
unsigned char   status;             //0x80 - active partition
unsigned char   headStart;          //starting head
unsigned int    cylSectStart;       //starting cylinder and sector
unsigned char   type;               //partition type 
unsigned char   headEnd;            //ending head of the partition
unsigned int    cylSectEnd;         //ending cylinder and sector
unsigned long   firstSector;        //total sectors between MBR & the first sector of the partition
unsigned long   sectorsTotal;       //size of this partition in sectors
};

//Structure to access boot sector data
struct BS_Structure{
unsigned char jumpBoot[3]; //default: 0x009000EB   //3
unsigned char OEMName[8];                          //11
unsigned int bytesPerSector; //deafault: 512       //13
unsigned char sectorPerCluster;                    //14
unsigned int reservedSectorCount;                  //16
unsigned char numberofFATs;                        //17
unsigned int rootEntryCount;                       //19
unsigned int totalSectors_F16; //must be 0 for FAT32    //21
unsigned char mediaType;                           //22
unsigned int FATsize_F16; //must be 0 for FAT32    //24
unsigned int sectorsPerTrack;                      //26
unsigned int numberofHeads;                        //28
unsigned long hiddenSectors;                       //32
unsigned long totalSectors_F32;                    //36
unsigned long FATsize_F32; //count of sectors occupied by one FAT   //40
unsigned int extFlags;                              //42
unsigned int FSversion; //0x0000 (defines version 0.0)  //44
unsigned long rootCluster; //first cluster of root directory (=2) //48
unsigned int FSinfo; //sector number of FSinfo structure (=1)   //50
unsigned int BackupBootSector;                      //52
unsigned char reserved[12];                         //64
unsigned char driveNumber;                          //65
unsigned char reserved1;                            //66
unsigned char bootSignature;                        //67
unsigned long volumeID;                             //71
unsigned char volumeLabel[11]; //"NO NAME "         //82
unsigned char fileSystemType[8]; //"FAT32"          //90
unsigned char bootData[420];                        //510
unsigned int bootEndSignature; //0xaa55             //512
};


//Structure to access FSinfo sector data
struct FSInfo_Structure
{
unsigned long leadSignature; //0x41615252
unsigned char reserved1[480];
unsigned long structureSignature; //0x61417272
unsigned long freeClusterCount; //initial: 0xffffffff
unsigned long nextFreeCluster; //initial: 0xffffffff
unsigned char reserved2[12];
unsigned long trailSignature; //0xaa550000
};


bool FAT32::init()
{
    _initialized = false;
    if (_sd->init() != 0)
    {
        _initialized = false;
        return _initialized;
    }

    unsigned char res = getBootSectorData();
    if (res == 0)
    {
        _initialized = true;
    }
    
    return _initialized;
}


bool FAT32::isInitialized()
{
    return _initialized;
}
//***************************************************************************
//Function: to read data from boot sector of SD card, to determine important
//parameters like _bytesPerSector, sectorsPerCluster etc.
